# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask"
tap "weaveworks/tap"
tap "homebrew/autoupdate"

# Brews
brew "ansible"
brew "terraform"
brew "kubernetes-cli"
brew "helm"
brew "awscli"
brew "bash-completion"
brew "wget"
brew "htop"
brew "dos2unix"
brew "jq"
brew "hstr"
brew "nmap"
brew "nodejs"
brew "gpg"
brew "git"
brew "golang"
brew "yarn"
brew "telnet"
brew "vault"
brew "rust"
brew "python"
brew "groovysdk"
brew "maven"
brew "tree"
brew "eksctl"
brew "operator-sdk"
brew "watch"
brew "azure-cli"
brew "packer"
brew "jsonpp"
brew "ruby"
brew "brew-gem"
brew "gitversion"
brew "awslogs"
brew "yamllint"
brew "yq"
brew "kubectx"
brew "istioctl"
brew "gomplate"
brew "k9s"
brew "k3d"
brew "shellcheck"
brew "pylint"
brew "hadolint"
brew "mysql-client"
brew "fd"
brew "tfenv"
brew "pinentry-mac"

# Casks
#cask "java"
cask "docker"
cask "google-chrome"
cask "google-cloud-sdk"
cask "visual-studio-code"
